tomyqg/STM32_RTT_F107/ECU/main/src/zigbee.c
//单点改变逆变器的PANID为ECU的MAC地址后四位,信道为指定信道(注:需要将ECU的PANID改为0xFFFF(万能发送))
int zb_change_inverter_channel_one(char *inverter_id, int channel)
{
	char sendbuff[512] = {'\0'};
	int i;
	int check=0;

	clear_zbmodem();
	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x0F;
	sendbuff[5]  = 0x00;
	sendbuff[6]  = 0x00;
	sendbuff[7]  = ecu.panid>>8;
	sendbuff[8]  = ecu.panid;
	sendbuff[9]  = channel;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0xA0;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x06;
	sendbuff[15]=((inverter_id[0]-0x30)*16+(inverter_id[1]-0x30));
	sendbuff[16]=((inverter_id[2]-0x30)*16+(inverter_id[3]-0x30));
	sendbuff[17]=((inverter_id[4]-0x30)*16+(inverter_id[5]-0x30));
	sendbuff[18]=((inverter_id[6]-0x30)*16+(inverter_id[7]-0x30));
	sendbuff[19]=((inverter_id[8]-0x30)*16+(inverter_id[9]-0x30));
	sendbuff[20]=((inverter_id[10]-0x30)*16+(inverter_id[11]-0x30));
	ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 21);
	printhexmsg("Change Inverter Channel (one)", sendbuff, 21);

	rt_thread_delay(RT_TICK_PER_SECOND); //此处延时必须大于1S
	return 0;
}

//改变传入逆变器ID的信道
int zb_change_channel(int num, char **ids)
{
	int i, j;
	char ecu_channel[16];

	clear_zbmodem();
	ecu_channel[0] = 0x0B;
	ecu_channel[1] = 0x0C;
	ecu_channel[2] = 0x0D;
	ecu_channel[3] = 0x0E;
	ecu_channel[4] = 0x0F;
	ecu_channel[5] = 0x10;
	ecu_channel[6] = 0x11;
	ecu_channel[7] = 0x12;
	ecu_channel[8] = 0x13;
	ecu_channel[9] = 0x14;
	ecu_channel[10] = 0x15;
	ecu_channel[11] = 0x16;
	ecu_channel[12] = 0x17;
	ecu_channel[13] = 0x18;
	ecu_channel[14] = 0x19;
	ecu_channel[15] = 0x1A;

	//改变每台逆变器的信道
	for (i=0; i<16; i++) {
		zb_restore_ecu_panid_0xffff(ecu_channel[i]); //改变ECU信道
		for (j=1; j<=num; j++) {
			if (RT_NULL != ids[j] && rt_strlen(ids[j])) {
				print2msg("inverter", ids[j]);
				zb_change_inverter_channel_one(ids[j], ecu.channel);
			}
		}
	}

	//设置ECU信道为配置文件中的信道
	zb_change_ecu_panid();

	return 0;
}


//还原逆变器信道
int zb_reset_channel(int num, char **ids)
{
	int i, j;
	char ecu_channel[16];

	clear_zbmodem();
	ecu_channel[0] = 0x0B;
	ecu_channel[1] = 0x0C;
	ecu_channel[2] = 0x0D;
	ecu_channel[3] = 0x0E;
	ecu_channel[4] = 0x0F;
	ecu_channel[5] = 0x10;
	ecu_channel[6] = 0x11;
	ecu_channel[7] = 0x12;
	ecu_channel[8] = 0x13;
	ecu_channel[9] = 0x14;
	ecu_channel[10] = 0x15;
	ecu_channel[11] = 0x16;
	ecu_channel[12] = 0x17;
	ecu_channel[13] = 0x18;
	ecu_channel[14] = 0x19;
	ecu_channel[15] = 0x1A;

	//还原每台逆变器的信道
	for (i=0; i<16; i++) {
		zb_restore_ecu_panid_0xffff(ecu_channel[i]); //改变ECU信道
		for (j=1; j<=num; j++) {
			if (RT_NULL != ids[j] && rt_strlen(ids[j])) {
				print2msg("inverter", ids[j]);
				zb_change_inverter_channel_one(ids[j], 0x10);
			}
		}
	}

	//设置ECU的信道为默认信道
	ecu.channel = 0x10;
	zb_change_ecu_panid();

	return 0;
}

//关闭逆变器ID上报 + 绑定逆变器
int zb_off_report_id_and_bind(int short_addr)
{
	int times = 3;
	char sendbuff[16] = {'\0'};
	char recvbuff[256] = {'\0'};
	int i;
	int check=0;

	do {
		//发送关闭逆变器ID上报+绑定操作
		clear_zbmodem();
		sendbuff[0]  = 0xAA;
		sendbuff[1]  = 0xAA;
		sendbuff[2]  = 0xAA;
		sendbuff[3]  = 0xAA;
		sendbuff[4]  = 0x08;
		sendbuff[5]  = short_addr>>8;
		sendbuff[6]  = short_addr;
		sendbuff[7]  = 0x00; //PANID(逆变器不解析)
		sendbuff[8]  = 0x00; //PANID(逆变器不解析)
		sendbuff[9]  = 0x00; //信道(逆变器不解析)
		sendbuff[10] = 0x00; //功率(逆变器不解析)
		sendbuff[11] = 0xA0;
		for(i=4;i<12;i++)
			check=check+sendbuff[i];
		sendbuff[12] = check/256;
		sendbuff[13] = check%256;
		sendbuff[14] = 0x00;
		ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL,0, sendbuff, 15);
		printhexmsg("Bind ZigBee", sendbuff, 15);

		//接收逆变器应答(短地址,ZigBee版本号,信号强度)
		if ((11 == zb_get_reply_from_module(recvbuff))
				&& (0xA5 == recvbuff[2])
				&& (0xA5 == recvbuff[3])) {
			//update_turned_off_rpt_flag(short_addr, (int)recvbuff[9]);
			//update_bind_zigbee_flag(short_addr);
			printmsg("Bind Successfully");
			return 1;
		}
	}while(--times);

	return 0;
}

int zigbeeRecvMsg(char *data, int timeout_sec)
{
	int count;
	rt_thread_delay( RD_DELAY );
	count = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data, 255);
	printhexmsg("Reply", data, count);
	return count;
}


#ifdef RT_USING_FINSH
#include <finsh.h>
FINSH_FUNCTION_EXPORT(zigbee_reset, reset zigbee module.)
void Zbtestcomm()		//测试通信
{
	zb_test_communication();
}
FINSH_FUNCTION_EXPORT(Zbtestcomm,zigbee test communication.)

void Zbecupanidffff(int channel)		//设置ECU panid为ffff 信道为channel
{
	zb_restore_ecu_panid_0xffff(channel);
}
FINSH_FUNCTION_EXPORT(Zbecupanidffff,zb_restore_ecu_panid_0xffff channel[int].)
	
void Zbecupanid()		//设置ECU panid 以及 信道   为ECU全局变量的值	
{
	zb_change_ecu_panid();
}
FINSH_FUNCTION_EXPORT(Zbecupanid,zb_change_ecu_panid.)

void Zbecupanid8888(int channel)	//设置ECU panid为0x8888  信道我ECU全局变量的值
{
	zb_restore_ecu_panid_0x8888();
}
FINSH_FUNCTION_EXPORT(Zbecupanid8888,zb_restore_ecu_panid_0x8888.)

void Zbinvchone(char *inverter_id, int channel)	//更改逆变器panid和信道 其中panid为全局变量ecu的信道
{
	zb_change_inverter_channel_one(inverter_id,channel);
}
FINSH_FUNCTION_EXPORT(Zbinvchone,zb_change_inverter_channel_one inverter_id[char *12] channel[int].)

/*void Zbgetshadd(char *inverter_id)	//获取逆变器短地址
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	zb_get_inverter_shortaddress_single(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetshadd,zb_get_inverter_shortaddress_single inverter_id[char *12].)
*/	
void Zbgetdata(char *inverter_id)	//获取数据
{
	inverter_info inverter;
	rt_memset(&inverter,0x00,sizeof(inverter));
	rt_memcpy(inverter.id,inverter_id,12);
	inverter.model = 7;
	zb_get_inverter_shortaddress_single(&inverter);
	zb_query_data(&inverter);
}
FINSH_FUNCTION_EXPORT(Zbgetdata,zb_query_data inverter_id[char *12].)
#endif
